# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text = 'Приветабв, абвмир! абв'
print(text)
new_text = text.replace("абв", "")
print(new_text)



